# Dataset Import and Export

* Data load and output for a variety of file types using its pd.read_ methods.
* Common data files including:
    * CSV
    * Excel
    * HTML
    * SQL
* Required installation (pip or conda) for excel, HTML and SQL file sources:
    * pip/conda install openpyxl
    * pip/conda install lxml
    * pip/conda install html5lib
    * pip/conda install BeautifulSoup4
    * pip/conda install sqlalchemy
* Type **pwd** to see the current working directory.

In [2]:
# Import Libraries
import numpy as np
import pandas as pd

In [3]:
pwd

'c:\\Users\\likre\\Downloads\\9 Python\\Python DS'

___
## 1. CSV
* The .read_csv() method

In [52]:
# Load CSV
df1 = pd.read_csv('ecsv1.csv')
df1

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [9]:
# Write data into a csv file

___
## 2. Excel
* The .read_excel() method
* Pandas can read and write excel files (ONLY imports data, NOT formulas or images).
* Importing images or macros will disable the read_excel method.

In [19]:
# Load an Excel file
# Pandas treats each excel sheet as a dataframe
pd.read_excel('excelsample1.xlsx', sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [17]:
# Write data into an excel file

___
## 3. HTML
* The .read_html() method.
* Scraping tables from websites.
* Recap: The required installation: 
    * htmllib5
    * lxml
    * BeautifulSoup4.

In [41]:
# Scrape data online (read tables from a webpage and return a list of dataframe objects)
# Example: South Korea Demographics --> one of the tables named 'Total fertility rate (2002â€“present)'
# Use parameter, match= to locate matching keywords in <caption> or table headers.
# Within the match=(''), use \s+ regex to capture any spaces in the search.
durl = 'https://en.wikipedia.org/wiki/Demographics_of_South_Korea'
df = pd.read_html(durl, match=('Total\s+fertility\s+rate'))
print(f'TYPE: {type(df)}, SIZE: {len(df)}')

TYPE: <class 'list'>, SIZE: 5

In [45]:
# Load the first column
df[0]

        Date  Fertility rate
0       2002           1.178
1       2003           1.191
2       2004           1.164
3       2005           1.085
4       2006           1.132
5       2007           1.259
6       2008           1.192
7       2009           1.149
8       2010           1.226
9       2011           1.244
10      2012           1.297
11      2013           1.187
12      2014           1.205
13      2015           1.239
14      2016           1.172
15      2017           1.052
16      2018           0.977
17      2019           0.918
18      2020           0.837
19  2021[24]           0.810
20      2022           0.780

_____
_____
_____
## 4. SQL (Optional)

* Note: Requires knowledge in SQL.
* The pandas.io.sql module provides a collection of query wrappers to both facilitate data retrieval and to reduce dependency on DB-specific API.
* Database abstraction is provided by SQLAlchemy if installed.
* Also, a driver library for the database will be required. Examples: psycopg2 for PostgreSQL or pymysql for MySQL.
* The Python standard library includes SQLite by default.
* An overview of supported drivers for each SQL dialect is available in the SQLAlchemy docs.

Some key functions:
* read_sql_table(table_name, con[, schema, ...])
    * Read SQL database table into a DataFrame.
* read_sql_query(sql, con[, index_col, ...])
    * Read SQL query into a DataFrame.
* read_sql(sql, con[, index_col, ...])
    * Read SQL query or database table into a DataFrame.
* DataFrame.to_sql(name, con[, flavor, ...])
    * Write records stored in a DataFrame to a SQL database.

In [53]:
from sqlalchemy import create_engine
engine = create_engine('sqlite:///:memory:')

In [54]:
df1.to_sql('data', engine)

4

In [ ]:
sqldf = pd.read_sql('data',con=engine)
sqldf

___